src/cf/Catalogs/ор_ДВЛП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ор_ДВЛП</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодРаздела</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>400</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеАнглийское</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеЛатинское</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаДействующегоВещества</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>АТХКлассификация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>АТХ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ор_КлассификаторАТХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/ор_ДВЛП/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция СоздатьЭлементКлассификатора(ПараметрыДанных) Экспорт
	
	РезультатВозврат = Новый Структура;
	РезультатВозврат.Вставить("ВсеЭлементы", Новый Соответствие);
	РезультатВозврат.Вставить("КоличествоНовыхЭлементов", 0);
	РезультатВозврат.Вставить("КоличествоОбновленныхЭлементов", 0);
	РезультатВозврат.Вставить("МассивНовыхЭлементов", Новый Массив);
	
	МассивНовыхЭлементов = Новый Массив;
	КоличествоОбновленныхЭлементов = 0;
	
	ПараметрыПолучения = Новый Структура;
	ПараметрыПолучения.Вставить("ТаблицаЗначений"           , Новый ТаблицаЗначений);
	ПараметрыПолучения.Вставить("ПоискПоНаименованию"       , Истина);
	ПараметрыПолучения.Вставить("ПоискПоНаименованиюПодобно", Ложь);
	ПараметрыПолучения.Вставить("Дерево"                    , Новый ДеревоЗначений);
	ПараметрыПолучения.Вставить("ОбновлятьСуществующие"     , Ложь);
	
	ПараметрыПолучения.Вставить("ПоискПоНаименованиюИКоду", Ложь);
	ПараметрыПолучения.Вставить("ПоискПоКоду"             , Ложь);
	
	Если ПараметрыДанных <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыПолучения, ПараметрыДанных);
	КонецЕсли;
	
	Если ПараметрыПолучения.ТаблицаЗначений.Количество() = 0 Тогда
		Возврат РезультатВозврат;
	КонецЕсли;
	
	Если ПараметрыПолучения.ТаблицаЗначений.Колонки.Найти("КодРаздела") <> Неопределено Тогда
		ПараметрыПолучения.ПоискПоНаименованиюИКоду = ЗначениеЗаполнено(ПараметрыПолучения.ТаблицаЗначений[0]["КодРаздела"]);
		ПараметрыПолучения.ПоискПоНаименованию      = Ложь;
	КонецЕсли;
	
	Если ПараметрыПолучения.ТаблицаЗначений.Колонки.Найти("КодРаздела") = Неопределено Тогда
		ПараметрыПолучения.ТаблицаЗначений.Колонки.Добавить("КодРаздела", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(10)));
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Таблица.Наименование КАК Наименование,
	|	Таблица.КодРаздела КАК КодРаздела
	|ПОМЕСТИТЬ Таб
	|ИЗ
	|	&Таблица КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таб.Наименование КАК Наименование,
	|	ЕСТЬNULL(Спр.Ссылка, ЗНАЧЕНИЕ(Справочник.ор_ДВЛП.ПустаяСсылка)) КАК Ссылка
	|ИЗ
	|	Таб КАК Таб
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ор_ДВЛП КАК Спр
	|		ПО (&ПоискПоНаименованиюИКоду
	|					И Таб.Наименование = Спр.Наименование
	|					И Таб.КодРаздела = Спр.КодРаздела
	|				ИЛИ &ПоискПоНаименованию
	|					И Таб.Наименование = Спр.Наименование
	|				ИЛИ &ПоискПоКоду
	|					И Таб.КодРаздела = Спр.КодРаздела
	|				ИЛИ &ПоискПоНаименованиюПодобно
	|					И Спр.Наименование ПОДОБНО ""%"" + Таб.Наименование + ""%"")");
	
	Запрос.УстановитьПараметр("Таблица", ПараметрыПолучения.ТаблицаЗначений);
	Запрос.УстановитьПараметр("ПоискПоНаименованию", ПараметрыПолучения.ПоискПоНаименованию);
	Запрос.УстановитьПараметр("ПоискПоНаименованиюПодобно", ПараметрыПолучения.ПоискПоНаименованиюПодобно);
	Запрос.УстановитьПараметр("ПоискПоКоду"               , ПараметрыПолучения.ПоискПоКоду);
	Запрос.УстановитьПараметр("ПоискПоНаименованиюИКоду"  , ПараметрыПолучения.ПоискПоНаименованиюИКоду);
	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ОбновлятьСуществующие = ПараметрыПолучения.ОбновлятьСуществующие;
	
	СоответсвиеЭлементов = Новый Соответствие;
	НайденыВсеЭлементы = Истина;
	Пока Выборка.Следующий() Цикл
		СоответсвиеЭлементов.Вставить(Выборка.Наименование, Выборка.Ссылка);
		Если Выборка.Ссылка.Пустая() Тогда
			НайденыВсеЭлементы = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	// Если не обновляем существующие и нет новых элементов, то выходим.
	Если НайденыВсеЭлементы И НЕ ОбновлятьСуществующие Тогда 
		РезультатВозврат.ВсеЭлементы = СоответсвиеЭлементов;
		РезультатВозврат.КоличествоНовыхЭлементов = МассивНовыхЭлементов.Количество();
		РезультатВозврат.КоличествоОбновленныхЭлементов = КоличествоОбновленныхЭлементов;
		РезультатВозврат.МассивНовыхЭлементов = МассивНовыхЭлементов;
		Возврат РезультатВозврат;
	КонецЕсли;
	
	// Формирование структуры реквизитов справочника.
	СтруктураДанных = Новый Структура();
	СтруктураДанных.Вставить("Наименование");
	
	// Реквизит для записи в ТЧ.
	СтруктураДанных.Вставить("АТХ");
	
	Для Каждого Реквизит Из Метаданные.Справочники.ор_ДВЛП.Реквизиты Цикл
		СтруктураДанных.Вставить(Реквизит.Имя);
		Если ПараметрыПолучения.ТаблицаЗначений.Колонки.Найти(Реквизит.Имя) = Неопределено Тогда
			ПараметрыПолучения.ТаблицаЗначений.Колонки.Добавить(Реквизит.Имя);
		КонецЕсли;
	КонецЦикла;
	
	ИзменяемыеЭлементы = ОбщегоНазначения.СкопироватьРекурсивно(СоответсвиеЭлементов);
	Для Каждого ТекущийЭлемент Из ИзменяемыеЭлементы Цикл
		СправочникСсылка = ТекущийЭлемент.Значение;
		
		Если НЕ СправочникСсылка.Пустая()
			И НЕ ОбновлятьСуществующие Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураПоиска = Новый Структура("Наименование", ТекущийЭлемент.Ключ);
		НайденныеСтроки = ПараметрыПолучения.Дерево.Строки.НайтиСтроки(СтруктураПоиска, Истина);
		Если НайденныеСтроки.Количество() > 0 Тогда
			ЗаполнитьЗначенияСвойств(СтруктураДанных, НайденныеСтроки[0]);
		Иначе
			НайденныеСтроки = ПараметрыПолучения.ТаблицаЗначений.НайтиСтроки(СтруктураПоиска);
			Если НайденныеСтроки.Количество() > 0 Тогда
				ЗаполнитьЗначенияСвойств(СтруктураДанных, НайденныеСтроки[0]);
			КонецЕсли;
		КонецЕсли;
		
		Если СправочникСсылка.Пустая() Тогда
			СсылкаСправочника = СоздатьЭлементСлужебный(
				СтруктураДанных,
				СправочникСсылка,
				ОбновлятьСуществующие);
			СоответсвиеЭлементов.Вставить(ТекущийЭлемент.Ключ, СсылкаСправочника);
			
			МассивНовыхЭлементов.Добавить(СсылкаСправочника);
		Иначе
			СоздатьЭлементСлужебный(СтруктураДанных, СправочникСсылка, ОбновлятьСуществующие);
			КоличествоОбновленныхЭлементов = КоличествоОбновленныхЭлементов + 1;
		КонецЕсли;
		
	КонецЦикла;
	
	РезультатВозврат.ВсеЭлементы = СоответсвиеЭлементов;
	РезультатВозврат.КоличествоНовыхЭлементов = МассивНовыхЭлементов.Количество();
	РезультатВозврат.КоличествоОбновленныхЭлементов = КоличествоОбновленныхЭлементов;
	РезультатВозврат.МассивНовыхЭлементов = МассивНовыхЭлементов;
	
	Возврат РезультатВозврат;
	
КонецФункции

Функция СоздатьЭлементСлужебный(Данные, СправочникСсылка, ОбновлятьСуществующие)
	
	Если СправочникСсылка.Пустая() Тогда
		СправочникОбъект = Справочники.ор_ДВЛП.СоздатьЭлемент();
	Иначе
		СправочникОбъект = СправочникСсылка.ПолучитьОбъект();
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(СправочникОбъект, Данные);
	
	СправочникОбъект.АТХКлассификация.Очистить();
	Если ЗначениеЗаполнено(Данные.АТХ) Тогда
		
		// Разбиваем строку со списком АТХ в массив.
		МассивАТХ = СтрРазделить(Данные.АТХ, ";", Ложь);
		Для Счетчик = 0 По МассивАТХ.Количество() - 1 Цикл
			МассивАТХ[Счетчик] = СокрЛП(МассивАТХ[Счетчик]);
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КлассификаторАТХ.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ АТХСсылки
		|ИЗ
		|	Справочник.ор_КлассификаторАТХ КАК КлассификаторАТХ
		|ГДЕ
		|	КлассификаторАТХ.КодРаздела В(&МассивАТХ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДВЛПАТХКлассификация.АТХ КАК АТХ
		|ПОМЕСТИТЬ ТЧДВЛП
		|ИЗ
		|	Справочник.ор_ДВЛП.АТХКлассификация КАК ДВЛПАТХКлассификация
		|ГДЕ
		|	ДВЛПАТХКлассификация.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АТХСсылки.Ссылка КАК Ссылка
		|ИЗ
		|	АТХСсылки КАК АТХСсылки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТЧДВЛП КАК ТЧДВЛП
		|		ПО АТХСсылки.Ссылка = ТЧДВЛП.АТХ
		|ГДЕ
		|	ВЫБОР
		|			КОГДА ТЧДВЛП.АТХ ЕСТЬ NULL
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ";
		
		Запрос.УстановитьПараметр("МассивАТХ", МассивАТХ);
		Запрос.УстановитьПараметр("Ссылка", СправочникСсылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НоваяСтрока = СправочникОбъект.АТХКлассификация.Добавить();
			НоваяСтрока.АТХ = ВыборкаДетальныеЗаписи.Ссылка;
		КонецЦикла;
		
	КонецЕсли;
	
	Попытка
		СправочникОбъект.Записать();
		_Возврат = СправочникОбъект.Ссылка;
	Исключение
		_Возврат = Справочники.ор_ДВЛП.ПустаяСсылка();
	КонецПопытки;
	
	Возврат _Возврат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
